Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_УчетРабочегоВремениНовый/РЗ_УчетРабочегоВремениНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЗ_УчетРабочегоВремениНовый</name>
  <registerRecords>AccumulationRegister.РЗ_УчетРабочегоВремени</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЗ_ВидыУчетаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетВремени</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.РЗ_Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_бухгалтерия.РасчетЗарплаты/src/AccumulationRegisters/РЗ_УчетРабочегоВремени/РЗ_УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РЗ_УчетРабочегоВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.РЗ_Задачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Enums/РЗ_ВидыУчетаРабочегоВремени/РЗ_ВидыУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЗ_ВидыУчетаРабочегоВремени</name>
  <enumValues>
    <name>Программирование</name>
  </enumValues>
  <enumValues>
    <name>Языки</name>
  </enumValues>
</mdclass:Enum>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_УчетРабочегоВремениНовый/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Хронометраж") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			Для Каждого СтрокаЗадач Из ДанныеЗаполнения.УчетВремени Цикл
				ЗаполнитьЗначенияСвойств(УчетВремени.Добавить(), СтрокаЗадач);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.РЗ_ВидыУчетаРабочегоВремени.Языки") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("УчетВремени.Задача");		
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Ссылка.Дата КАК Период,
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Контакт,
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Задача,
		|	СУММА(РЗ_УчетРабочегоВремениНовыйУчетВремени.КоличествоЧасов) КАК КоличествоЧасов
		|ИЗ
		|	Документ.РЗ_УчетРабочегоВремениНовый.УчетВремени КАК РЗ_УчетРабочегоВремениНовыйУчетВремени
		|ГДЕ
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Ссылка.Дата,
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Контакт,
		|	РЗ_УчетРабочегоВремениНовыйУчетВремени.Задача";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// регистр РЗ_УчетРабочегоВремени
	Движения.РЗ_УчетРабочегоВремени.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.РЗ_УчетРабочегоВремени.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли
